In [6]:
#Question1:
#Answer:
import pandas as pd
data  = [4,8,16,23,42]
series = pd.Series(data)
print(series)

0     4
1     8
2    16
3    23
4    42
dtype: int64

In [7]:
#Question2:
#Answer:

my_data = [1,2,3,4,5,6,7,8,9,10]
series1 = pd.Series(my_data)
print(series1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
#Question3:
#Answer:

given_data = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
df = pd.DataFrame(given_data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
#Question4:
#Answer:

"""
In Pandas, a DataFrame is a 2-dimensional labeled data structure that represents a tabular data structure
similar to a spreadsheet or SQL table. It consists of rows and columns, 
where each column can have a different data type.
The DataFrame is one of the most commonly used data structures in Pandas and provides a 
powerful and flexible way to manipulate and analyze data.

On the other hand, a Series is a 1-dimensional labeled array that can store data of any type 
(integers, strings, floats, etc.). It is similar to a Python list or a NumPy array, 
but with the added benefit of having labeled indices, 
allowing for more efficient data access and manipulation.
"""
given_data = {
    "Name":["Alice","Bob","Claire"],
    "Age":[25,30,27],
    "Gender":["Female","Male","Female"]
}
df = pd.DataFrame(given_data)
print("##DATAFRAME##")
print(df)
series2 = df['Name']
print("##SERIES##")
type(series2)
print(series2)

##DATAFRAME##
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
##SERIES##
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [19]:
#Question5:
#Answer:

data_tb = {
            "Name":["Aman","Saurabh","Shobhit","Umair"],
            "Age":[20,20,21,22],
            "Gender":["Male","Female","Female","Male"]
}
create_df = pd.DataFrame(data_tb)
create_df

      Name  Age  Gender
0     Aman   20    Male
1  Saurabh   20  Female
2  Shobhit   21  Female
3    Umair   22    Male

In [20]:
create_df.head(2)

      Name  Age  Gender
0     Aman   20    Male
1  Saurabh   20  Female

In [21]:
create_df.tail(2)

      Name  Age  Gender
2  Shobhit   21  Female
3    Umair   22    Male

In [22]:
create_df['Age'].describe()

count     4.000000
mean     20.750000
std       0.957427
min      20.000000
25%      20.000000
50%      20.500000
75%      21.250000
max      22.000000
Name: Age, dtype: float64

In [24]:
create_df.iloc[0:3 , [1]]

   Age
0   20
1   20
2   21

In [25]:
create_df.loc[0:3 , ["Name"]]

      Name
0     Aman
1  Saurabh
2  Shobhit
3    Umair

In [ ]:
#Question6:
#Answer:
"""
In Pandas, both Series and DataFrame are mutable in nature, meaning you can modify their contents after creation.
However, Panel is considered immutable, which means you cannot change its data once it has been created.
"""

In [27]:
create_df

      Name  Age  Gender
0     Aman   20    Male
1  Saurabh   20  Female
2  Shobhit   21  Female
3    Umair   22    Male

In [30]:
#Dataframe Mutablity
create_df['Age'] = [10,23,45,67]

In [31]:
create_df

      Name  Age  Gender
0     Aman   10    Male
1  Saurabh   23  Female
2  Shobhit   45  Female
3    Umair   67    Male

In [45]:
#Series Mutability
d = [1,2,3,4]

In [42]:
series6 = pd.Series(d)

In [43]:
series6[2] = 55

In [44]:
series6

0     1
1     2
2    55
3     4
dtype: int64

In [46]:
#Question7:
#Answer:
age = [10,20,30]
name = ["Aman","Shivam","Harsh"]
s_name = ["Kumar","Suman","Vardhan"]

age_series = pd.Series(age)
name_series = pd.Series(name)
sname_series = pd.Series(s_name)

In [50]:
age_series

0    10
1    20
2    30
dtype: int64

In [51]:
name_series

0      Aman
1    Shivam
2     Harsh
dtype: object

In [52]:
sname_series

0      Kumar
1      Suman
2    Vardhan
dtype: object

In [ ]:
dataframe = {
    "": ,
    "": ,
    ""

}